Revit 2024 API
LayeredNdfType Enumeration
 The enumerated type representing the permitted values for the asset property "LayeredNdfType" from the "AdvancedLayered" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum LayeredNdfType
Visual Basic
Public Enumeration LayeredNdfType
Visual C++
public enum class LayeredNdfType
Members
Member name | Description
Beckmann
Ggx
See Also
Autodesk.Revit.DB.Visual Namespace